Tekla Open API Reference for Tekla Structures 2025
ClosedGraphicObject.ClosedGraphicObjectAttributes Class
 The ClosedGraphicObjectAttributes class is the attributes class for the closed graphic object.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.GraphicObject.GraphicObjectAttributes
 Tekla.Structures.Drawing.ClosedGraphicObject.ClosedGraphicObjectAttributes
 Tekla.Structures.Drawing.Circle.CircleAttributes
 Tekla.Structures.Drawing.Cloud.CloudAttributes
 Tekla.Structures.Drawing.Polygon.PolygonAttributes
 Tekla.Structures.Drawing.Rectangle.RectangleAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class ClosedGraphicObjectAttributes : GraphicObject.GraphicObjectAttributes
<SerializableAttribute>
Public MustInherit Class ClosedGraphicObjectAttributes
	Inherits GraphicObject.GraphicObjectAttributes
The ClosedGraphicObject.ClosedGraphicObjectAttributes type exposes the following members.
Properties
Name | Description
BehindModelObjects
 Gets or sets whether the closed graphic object is drawn behind model objects
Hatch
 The hatch attributes of the closed graphic object (the closed graphic object is hatchable).
Line
 The line attributes of the graphic object. A graphic object always consists of lines.
 (Inherited from GraphicObject.GraphicObjectAttributes.)
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Inherited from AttributesBase.)
LoadAttributes
 Loads the attributes from the specified file.
 (Inherited from AttributesBase.)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace